In [5]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import randn

In [6]:
ser = Series(randn(6),index =[[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [7]:
ser

1  a   -1.083702
   b   -0.216615
   c    0.080371
2  a    0.842517
   b    1.115971
   c   -0.206760
dtype: float64

In [8]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [9]:
ser[1]

a   -1.083702
b   -0.216615
c    0.080371
dtype: float64

In [10]:
ser[2]

a    0.842517
b    1.115971
c   -0.206760
dtype: float64

In [11]:
ser[:,'a']

1   -1.083702
2    0.842517
dtype: float64

In [12]:
dframe = ser.unstack()

In [13]:
dframe

          a         b         c
1 -1.083702 -0.216615  0.080371
2  0.842517  1.115971 -0.206760

In [14]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,1,2]],
                   columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [16]:
dframe2.index.names = ['INDEX_1','INDEX_2']

dframe2.columns.names = ['Cities','Temp']

dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [18]:
dframe2.swaplevel('Cities','Temp',axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [19]:
dframe2.swaplevel('INDEX_1','INDEX_2')

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_2 INDEX_1
1       a          0   1   2    3
2       a          4   5   6    7
1       b          8   9  10   11
2       b         12  13  14   15

In [20]:
dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [39]:
dframe2.sort_index(level=1)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [40]:
dframe2.sum(level='Temp',axis=1)

C:\Users\80847266\AppData\Local\Temp\ipykernel_29904\419258034.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  dframe2.sum(level='Temp',axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27

In [58]:
dframe2.groupby(axis=1, level=1).sum()

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27